
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
  "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">


<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    
    <title>Sage as a Calculator &mdash; SDSU Sage Tutorial v1.1</title>
    
    <link rel="stylesheet" href="_static/default.css" type="text/css" />
    <link rel="stylesheet" href="_static/pygments.css" type="text/css" />
    
    <script type="text/javascript">
      var DOCUMENTATION_OPTIONS = {
        URL_ROOT:    './',
        VERSION:     '1.1',
        COLLAPSE_INDEX: false,
        FILE_SUFFIX: '.html',
        HAS_SOURCE:  true
      };
    </script>
    <script type="text/javascript" src="_static/jquery.js"></script>
    <script type="text/javascript" src="_static/underscore.js"></script>
    <script type="text/javascript" src="_static/doctools.js"></script>
    <link rel="author" title="About these documents" href="about.html" />
    <link rel="top" title="SDSU Sage Tutorial v1.1" href="index.html" />
    <link rel="next" title="Programming in Sage" href="sageprog.html" />
    <link rel="prev" title="About this tutorial" href="about.html" /> 
  </head>
  <body>
    <div class="related">
      <h3>Navigation</h3>
      <ul>
        <li class="right" style="margin-right: 10px">
          <a href="genindex.html" title="General Index"
             accesskey="I">index</a></li>
        <li class="right" >
          <a href="sageprog.html" title="Programming in Sage"
             accesskey="N">next</a> |</li>
        <li class="right" >
          <a href="about.html" title="About this tutorial"
             accesskey="P">previous</a> |</li>
        <li><a href="index.html">SDSU Sage Tutorial v1.1</a> &raquo;</li> 
      </ul>
    </div>  

    <div class="document">
      <div class="documentwrapper">
        <div class="bodywrapper">
          <div class="body">
            
  <div class="section" id="sage-as-a-calculator">
<span id="index-0"></span><span id="id1"></span><h1>Sage as a Calculator<a class="headerlink" href="#sage-as-a-calculator" title="Permalink to this headline">¶</a></h1>
<p>This part of the tutorial examines commands that  allow you to use Sage much like a graphing calculator.  The chapter on  arithmetic and functions and the chapter on solving equations and inequalities serve as a foundation for the rest of the material.   The chapters on plotting, statistics and  calculus are independent of each other, although plotting may be useful to read next since plotting graphs is so is useful in calculus and in statistics.</p>
<div class="section" id="arithmetic-and-functions">
<span id="index-1"></span><span id="id2"></span><h2>Arithmetic and Functions<a class="headerlink" href="#arithmetic-and-functions" title="Permalink to this headline">¶</a></h2>
<div class="section" id="basic-arithmetic">
<span id="index-2"></span><span id="id3"></span><h3>Basic Arithmetic<a class="headerlink" href="#basic-arithmetic" title="Permalink to this headline">¶</a></h3>
<p id="index-3">The basic arithmetic operators are <tt class="docutils literal"><span class="pre">+</span></tt>, <tt class="docutils literal"><span class="pre">-</span></tt>, <tt class="docutils literal"><span class="pre">*</span></tt>, and <tt class="docutils literal"><span class="pre">/</span></tt> for addition, subtraction, multiplication and division, while <tt class="docutils literal"><span class="pre">^</span></tt> is used for exponents.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 1+1
2
sage: 103-101
2
sage: 7*9
63
sage: 7337/11
667
sage: 11/4
11/4
sage: 2^5
32
</pre></div>
</div>
<p>The <tt class="docutils literal"><span class="pre">-</span></tt> symbol in front of a number indicates that it is negative.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: -6
-6
sage: -11+9
-2
</pre></div>
</div>
<p id="index-4">As we would expect, Sage adheres to the standard order of operations,
PEMDAS (parenthesis, exponents, multiplication, division, addition,
subtraction).</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 2*4^2+1
33
sage: (2*4)^2+1
65
sage: 2*4^(2+1)
128
sage: -3^2
-9
sage: (-3)^2
9
</pre></div>
</div>
<p>When dividing two integers, there is a subtlety; whether Sage will return a fraction or it&#8217;s decimal approximation. Unlike most graphing calculators, Sage will attempt to be as <em>precise</em> as possible and will return the fraction unless told otherwise. One way to tell Sage that we <em>want</em> the decimal approximation is to include a decimal in the expression itself.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 11/4.0
2.75000000000000
sage: 11/4.
2.75000000000000
sage: 11.0/4
2.75000000000000
sage: 11/4*1.
2.75000000000000
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Divide <img class="math" src="_images/math/84694b4fae450030683bbf8f625842d07b444fca.png" alt="28"/> by <img class="math" src="_images/math/15c663954a3e059d1f876bc8a4621de376038c96.png" alt="2"/> raised to the 5th power as a  rational number, then get it&#8217;s decimal approximation.</li>
<li>Compute a decimal approximation of <img class="math" src="_images/math/f8117cd5193e9c43e4cac4a86cc0298690ef3f79.png" alt="\sqrt{2}"/></li>
<li>Use sage to compute <tt class="docutils literal"><span class="pre">(-9)^(1/2)</span></tt>. Describe the output.</li>
</ol>
</div></blockquote>
</div>
<div class="section" id="integer-division-and-factoring">
<span id="division-and-factoring"></span><span id="index-5"></span><h3>Integer Division and Factoring<a class="headerlink" href="#integer-division-and-factoring" title="Permalink to this headline">¶</a></h3>
<blockquote>
<div>You should be familiar with &#8220;<a class="reference internal" href="#basic-arithmetic"><em>Basic Arithmetic</em></a>&#8220;</div></blockquote>
<p>Sometimes when we divide, the division operator doesn&#8217;t give us all of the information that we want. Often we would like to not just know what the reduced fraction is, or even it&#8217;s decimal approximation, but rather the unique <em>quotient</em> and the <em>remainder</em> that are the consequence of the division.</p>
<p id="index-6">To calculate the quotient we use the <tt class="docutils literal"><span class="pre">//</span></tt> operator and the <tt class="docutils literal"><span class="pre">%</span></tt> operator is used for the remainder.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 14 // 4
3
sage: 14 % 4
2
</pre></div>
</div>
<p id="index-7">If we want both the quotient and the remainder all at once, we use the <a class="reference external" href="http://docs.python.org/library/functions.html#divmod" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">divmod()</span></tt></a> command</p>
<div class="highlight-python"><div class="highlight"><pre>sage: divmod(14,4)
(3, 2)
</pre></div>
</div>
<p id="index-8">Recall that <img class="math" src="_images/math/5e87bf41a96deddf6cb485ff530f153f2590e9cc.png" alt="b"/> <em>divides</em> <img class="math" src="_images/math/7dd2a5ea01fbd72ad2a58dd1f3d6ecbfde6208a1.png" alt="a"/> if <img class="math" src="_images/math/74c081db590f3d35421c1f6b9afd4cdda36ee210.png" alt="0"/> is the remainder when we divide the two integers. The integers in Sage have a built-in command ( or &#8216;method&#8217; ) which allows us to check whether one integer divides another.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 3.divides(15)
True
sage: 5.divides(17)
False
</pre></div>
</div>
<p id="index-9">A related command is the <tt class="xref py py-meth docutils literal"><span class="pre">divisors()</span></tt> method. This method returns
a list of all positive divisors of the integer specified.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 12.divisors()
[1, 2, 3, 4, 6, 12]
sage: 101.divisors()
[1,101]
</pre></div>
</div>
<p id="index-10">When the divisors of an integer are only <img class="math" src="_images/math/123e375e88da91240024aaf085abee194c4a2d06.png" alt="1"/> and itself then we say that the number is <em>prime</em>. To check if a number is prime in sage, we use it&#8217;s <tt class="xref py py-meth docutils literal"><span class="pre">is_prime()</span></tt> method.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: (2^19-1).is_prime()
True
sage: 153.is_prime()
False
</pre></div>
</div>
<p>Notice the parentheses around <tt class="docutils literal"><span class="pre">2^19</span> <span class="pre">-1</span></tt> in the first example. They are important to the order of operations in Sage, and if they are not included then Sage will compute something very different than we intended. Try evaluating <tt class="docutils literal"><span class="pre">2^19-1.is_prime()</span></tt> and notice the result.  When in doubt, the judicious use of <em>parenthesis</em> is encouraged.</p>
<p id="index-11">We use the <tt class="xref py py-meth docutils literal"><span class="pre">factor()</span></tt> method to compute the <em>prime factorization</em> of an integer.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 62.factor()
2 * 31
sage: 63.factor()
3^2 * 7
</pre></div>
</div>
<p id="index-12">If we are interested in simply knowing which prime numbers divide an integer, we may use it&#8217;s <tt class="xref py py-meth docutils literal"><span class="pre">prime_divisors()</span></tt> (or <tt class="xref py py-meth docutils literal"><span class="pre">prime_factors()</span></tt>) method.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 24.prime_divisors()
[2, 3]
sage: 63.prime_factors()
[3, 7]
</pre></div>
</div>
<p id="index-13">Finally, we have the <em>greatest common divisor</em> and <em>least common multiple</em> of a pair of integers. A <em>common divisor</em> of two integers is any integer which is a divisor of each, whereas a <em>common multiple</em> is a number which both integers divide.</p>
<p>The greatest common divisor (gcd), not too surprisingly, is the largest of all of these common divisors. The <tt class="xref py py-func docutils literal"><span class="pre">gcd()</span></tt> command is used to calculate this divisor.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: gcd(14,63)
7
sage: gcd(15,19)
1
</pre></div>
</div>
<p>Notice that if two integers share no common divisors, then their gcd will be <img class="math" src="_images/math/123e375e88da91240024aaf085abee194c4a2d06.png" alt="1"/>.</p>
<p>The least common multiple is the smallest integer which both integers divide. The <tt class="xref py py-func docutils literal"><span class="pre">lcm()</span></tt> command is used to calculate the least common multiple.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: lcm(4,5)
20
sage: lcm(14,21)
42
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Find the quotient and remainder when diving <img class="math" src="_images/math/0860fe3a10da62a21a4619fd4939371d694a7723.png" alt="98"/> into <img class="math" src="_images/math/12a9873dc6527b68f77765a028d4aea9461ae70c.png" alt="956"/>.</li>
<li>Use Sage to verify that the quotient and remainder computed above are correct.</li>
<li>Use Sage to determine if <img class="math" src="_images/math/b9b358d9bbdf54c3d9aef7554638822d996c21ea.png" alt="3"/> divides <img class="math" src="_images/math/30076eabfe4b52fed5bc97cfbc38ce14cc6c054e.png" alt="234878"/>.</li>
<li>Compute the list of divisors for each of the integers <img class="math" src="_images/math/f17b414af4c527203f6afcd0c6681919f189f383.png" alt="134,\ 491,\ 422"/> and <img class="math" src="_images/math/5da201b680f77726c5fef51d842712623db1988b.png" alt="1002"/>.</li>
<li>Which of the integers above are <em>prime</em>?</li>
<li>Calculate <img class="math" src="_images/math/73ccd585738fe1d03942f9402cb12c53ee3090fa.png" alt="\mathrm{gcd}(a,b)"/>,  <img class="math" src="_images/math/a0166081f3f0181301ab5ae6d0b9c86c70fd3c35.png" alt="\mathrm{lcm}(a,b)"/> and <img class="math" src="_images/math/4ae1c72d0725e36aeba0179fb9470fb960a00cee.png" alt="a \cdot b"/> for the pairs of integers <img class="math" src="_images/math/ad018b2681c8d6f59348d74fa686e37a29cdfff9.png" alt="\left(2,5\right),\ \left(4,10\right)"/> and <img class="math" src="_images/math/8adb1371a051c6df6e639dab7d2dd75b13bff27c.png" alt="\left(18,51\right)"/>. How do the gcd, lcm and the product of the numbers relate?</li>
</ol>
</div></blockquote>
</div>
<div class="section" id="standard-functions-and-constants">
<span id="basic-functions-and-constants"></span><span id="index-14"></span><h3>Standard Functions and Constants<a class="headerlink" href="#standard-functions-and-constants" title="Permalink to this headline">¶</a></h3>
<p>Sage includes nearly all of the standard functions that one encounters
when studying mathematics. In this section, we shall cover some of the
most commonly used functions: the <em>maximum</em>, <em>minimum</em>, <em>floor</em>,
<em>ceiling</em>, <em>trigonometric</em>, <em>exponential</em>, and <em>logarithm</em> functions.
We will also see many of the standard mathematical constants; such as <em>Euler&#8217;s constant</em> (<img class="math" src="_images/math/630e3a780577ea7921e81ee2ac5237dd1802ec8d.png" alt="e"/>), <img class="math" src="_images/math/c1bd4cb4e3647c6b2356b7ccf2f52aeffedd1b61.png" alt="\pi"/>, and <em>the golden ratio</em> (<img class="math" src="_images/math/10e009bdb83f96c5f47c58b34d5d4b12ef268d5b.png" alt="\phi"/>).</p>
<p id="index-15">The <a class="reference external" href="http://docs.python.org/library/functions.html#max" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">max()</span></tt></a> and <a class="reference external" href="http://docs.python.org/library/functions.html#min" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">min()</span></tt></a> commands return the largest and smallest of a set of numbers.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: max(1,5,8)
8
sage: min(1/2,1/3)
1/3
</pre></div>
</div>
<p>We may input any number of arguments into the max and min functions.</p>
<p id="index-16">In Sage we use the <a class="reference external" href="http://docs.python.org/library/functions.html#abs" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">abs()</span></tt></a> command to compute the <em>absolute value</em> of
a real number.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: abs(-10)
10
sage: abs(4)
4
</pre></div>
</div>
<p id="index-17">The <tt class="xref py py-func docutils literal"><span class="pre">floor()</span></tt> command rounds a number down to the nearest integer, while <tt class="xref py py-func docutils literal"><span class="pre">ceil()</span></tt> rounds up.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: floor(2.1)
2
sage: ceil(2.1)
3
</pre></div>
</div>
<p>We need to be very careful while using <tt class="xref py py-func docutils literal"><span class="pre">floor()</span></tt> and <tt class="xref py py-func docutils literal"><span class="pre">ceil()</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: floor(1/(2.1-2))
9
</pre></div>
</div>
<p>This is clearly not correct: <img class="math" src="_images/math/df2282a7aa4807e3dd05be5e209d1e740aa4d6c1.png" alt="\lfloor 1/(2.1-2)\rfloor = \lfloor 1/.1 \rfloor = \lfloor 10 \rfloor = 10"/>. So what happened?</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 1/(2.1-2)
9.99999999999999
</pre></div>
</div>
<p>Computers store real numbers in <em>binary</em>, while we are accustomed to using the decimal representation. The <img class="math" src="_images/math/d9d399703d979e72895752f9979047ad8aa0b590.png" alt="2.1"/> in decimal notation is quite simple and short, but when converted to binary it is <img class="math" src="_images/math/86f288c2ab5fb6c668cce98708c84359b516f96a.png" alt="10.0001\overline{1}=10.0001100110011\ldots"/></p>
<p>Since computers cannot store an infinite number of digits, this gets rounded off somewhere, resulting in the slight error we saw. In Sage, however, <em>rational numbers</em> (fractions) are exact, so we will never see this rounding error.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: floor(1/(21/10-2))
10
</pre></div>
</div>
<p>Due to this, it is often a good idea to use rational numbers whenever possible instead of decimals, particularly if a high level of precision is required.</p>
<p id="index-18">The <tt class="xref py py-func docutils literal"><span class="pre">sqrt()</span></tt> command calculates the <em>square root</em> of a real number. As we have seen earlier with fractions, if we want a decimal approximation we can get this by giving a decimal number as the input.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: sqrt(3)
sqrt(3)
sage: sqrt(3.0)
1.73205080756888
</pre></div>
</div>
<p>To compute other roots, we use a rational exponent. Sage can compute any rational power. If either the exponent or the base is a decimal then the output will be a decimal.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 3^(1/2)
sqrt(3)
sage: (3.0)^(1/2)
1.73205080756888
sage: 8^(1/2)
2*sqrt(2)
sage: 8^(1/3)
2
</pre></div>
</div>
<p id="index-19">Sage also has available all of the standard trigonometric functions: for sine and cosine we use <tt class="xref py py-func docutils literal"><span class="pre">sin()</span></tt> and <tt class="xref py py-func docutils literal"><span class="pre">cos()</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: sin(1)
sin(1)
sage: sin(1.0)
0.841470984807897
sage: cos(3/2)
cos(3/2)
sage: cos(3/2.0)
0.0707372016677029
</pre></div>
</div>
<p>Again we see the same behavior that we saw with <tt class="xref py py-func docutils literal"><span class="pre">sqrt()</span></tt>, Sage will give us an exact answer.  You might think that since there is no way to simplify <tt class="docutils literal"><span class="pre">sin(1)</span></tt>,  why bother?  Well, some expressions involving sine can indeed be simplified. For example, an important identity from geometry is <img class="math" src="_images/math/24eb2b357744924c6c6e54e9dc037c02d08a15ae.png" alt="\sin(\pi/3 ) = \sqrt{3}/2"/>. Sage has a built-in symbolic <img class="math" src="_images/math/c1bd4cb4e3647c6b2356b7ccf2f52aeffedd1b61.png" alt="\pi"/>, and understands this identity:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: pi
pi
sage: sin(pi/3)
1/2*sqrt(3)
</pre></div>
</div>
<p id="index-20">When we type <tt class="xref py py-obj docutils literal"><span class="pre">pi</span></tt> in Sage we are dealing exactly with <img class="math" src="_images/math/c1bd4cb4e3647c6b2356b7ccf2f52aeffedd1b61.png" alt="\pi"/>, not some numerical approximation. However, we can call for a numerical approximation using the <tt class="xref py py-meth docutils literal"><span class="pre">n()</span></tt> method:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: pi.n()
3.14159265358979
sage: sin(pi)
0
sage: sin(pi.n())
1.22464679914735e-16
</pre></div>
</div>
<p>We see that when using the symbolic <tt class="xref py py-obj docutils literal"><span class="pre">pi</span></tt>, Sage returns the exact result. However,  when we use the approximation we get an approximation back. <tt class="docutils literal"><span class="pre">e-15</span></tt> is a shorthand for <img class="math" src="_images/math/89170fb33b3fb595671340ccb2d31cbe1bec1a53.png" alt="10^{-15}"/> and the number <tt class="docutils literal"><span class="pre">1.22464679914735e-16</span></tt> should be zero, but there are errors introduced by the approximation. Here are a few examples of using the symbolic, precise <img class="math" src="_images/math/c1bd4cb4e3647c6b2356b7ccf2f52aeffedd1b61.png" alt="\pi"/> vs the numerical approximation:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: sin(pi/6)
1/2
sage: sin(pi.n()/6)
0.500000000000000
sage: sin(pi/4)
1/2*sqrt(2)
sage: sin(pi.n()/4)
0.707106781186547
</pre></div>
</div>
<p>Continuing on with the theme, there are some lesser known special angles for which the value of sine or cosine can be cleverly simplified.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: sin(pi/10)
1/4*sqrt(5) - 1/4
sage: cos(pi/5)
1/4*sqrt(5) + 1/4
sage: sin(5*pi/12)
1/12*(sqrt(3) + 3)*sqrt(6)
</pre></div>
</div>
<p id="index-21">Other trigonometric functions, the inverse trigonometric functions and hyperbolic functions are also available.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: arctan(1.0)
0.785398163397448
sage: sinh(9.0)
4051.54190208279
</pre></div>
</div>
<p id="index-22">Similar to <tt class="xref py py-obj docutils literal"><span class="pre">pi</span></tt> Sage has a built-in symbolic constant for the number <img class="math" src="_images/math/630e3a780577ea7921e81ee2ac5237dd1802ec8d.png" alt="e"/>, the base of the natural logarithm.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: e
e
sage: e.n()
2.71828182845905
</pre></div>
</div>
<p id="index-23">While some might be familiar with using <tt class="docutils literal"><span class="pre">ln(x)</span></tt> for natural log and <tt class="docutils literal"><span class="pre">log(x)</span></tt> to represent logarithm base <img class="math" src="_images/math/1984d1a61055b785e860b105bc14f1f2221f3476.png" alt="10"/>, in Sage both represent logarithm
base <img class="math" src="_images/math/630e3a780577ea7921e81ee2ac5237dd1802ec8d.png" alt="e"/>.  We may specify a different base as a second argument to the command: to compute <img class="math" src="_images/math/35cd65d41f7069822bf5221d2c75074968f6733b.png" alt="\log_{b}(x)"/> in Sage we use the command <tt class="docutils literal"><span class="pre">log(x,b)</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: ln(e)
1
sage: log(e)
1
sage: log(e^2)
2
sage: log(10)
log(10)
sage: log(10.0)
2.30258509299405
sage: log(100,10)
2
</pre></div>
</div>
<p id="index-24">Exponentiation base <img class="math" src="_images/math/630e3a780577ea7921e81ee2ac5237dd1802ec8d.png" alt="e"/> can done using both the <tt class="xref py py-func docutils literal"><span class="pre">exp()</span></tt> function and by raising the symbolic constant <tt class="docutils literal"><span class="pre">e</span></tt> to a specified power.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: exp(2)
e^2
sage: exp(2.0)
7.38905609893065
sage: exp(log(pi))
pi
sage: e^(log(2))
2
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Compute the floor and ceiling of <img class="math" src="_images/math/96625fdcfe2ee287350c1136abe09ca1d8636590.png" alt="2.75"/>.</li>
<li>Compute the logarithm base <img class="math" src="_images/math/630e3a780577ea7921e81ee2ac5237dd1802ec8d.png" alt="e"/> of  <img class="math" src="_images/math/95280ca2c509f2e4fa3e78d2334b22ef1cba098a.png" alt="1/1000000"/>, compute the logarithm base 10 of  <img class="math" src="_images/math/95280ca2c509f2e4fa3e78d2334b22ef1cba098a.png" alt="1/1000000"/>, then compute the ratio.  What should the answer be?</li>
<li>Compute the logarithm base 2 of <img class="math" src="_images/math/3a981d14c902442cc0087974a07c4c6d69ae006b.png" alt="64"/>.</li>
<li>Compare <img class="math" src="_images/math/a0f12841b71904324162efce0d286bec92e3e7b3.png" alt="e^{i \pi}"/> with a numerical approximation of it using <tt class="docutils literal"><span class="pre">pi.n()</span></tt>.</li>
<li>Compute <img class="math" src="_images/math/e472b87fbe9c7cb7f9fde060cefb47e83271d29d.png" alt="\sin(\pi/2)"/>, <img class="math" src="_images/math/06a948dafc10d396b21ede9f4583a4c325bfb0bf.png" alt="\cot(0)"/> and <img class="math" src="_images/math/4890f35cb94a7f20f757a54d8990077dc517b258.png" alt="\csc(\pi/16)"/>.</li>
</ol>
</div></blockquote>
</div>
</div>
<div class="section" id="solving-equations-and-inequalities">
<span id="solving-equations-inequalities"></span><span id="index-25"></span><h2>Solving Equations and Inequalities<a class="headerlink" href="#solving-equations-and-inequalities" title="Permalink to this headline">¶</a></h2>
<div class="section" id="solving-for-x">
<span id="solving-x"></span><span id="index-26"></span><h3>Solving for x<a class="headerlink" href="#solving-for-x" title="Permalink to this headline">¶</a></h3>
<blockquote>
<div>You should be familiar with &#8220;<a class="reference internal" href="#basic-arithmetic"><em>Basic Arithmetic</em></a>&#8221; and &#8220;<a class="reference internal" href="#basic-functions-and-constants"><em>Standard Functions and Constants</em></a>&#8220;</div></blockquote>
<p id="index-27">In Sage, equations and inequalities are defined using the <em>operators</em> <tt class="docutils literal"><span class="pre">==</span></tt>, <tt class="docutils literal"><span class="pre">&lt;=</span></tt>, and <tt class="docutils literal"><span class="pre">&gt;=</span></tt> and will return either <tt class="docutils literal"><span class="pre">True</span></tt>, <tt class="docutils literal"><span class="pre">False</span></tt>, or, if there is a variable, just the equation/inequality.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: 9 == 9
True
sage: 9 &lt;= 10
True
sage: 3*x - 10 == 5
3*x - 10 == 5
</pre></div>
</div>
<p id="index-28">To solve an equation or an inequality we use using the, aptly named, <tt class="xref py py-func docutils literal"><span class="pre">solve()</span></tt> command. For the moment, we will only solve for <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/>.  The section on variables below explains how to use other variables.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve(3*x - 2 == 5,x)
[x == (7/3)]
sage: solve( 2*x -5 == 1, x)
[x == 3]
sage: solve( 2*x - 5 &gt;= 17,x)
[[x &gt;= 11]]
sage: solve( 3*x -2 &gt; 5, x)
[[x &gt; (7/3)]]
</pre></div>
</div>
<p>Equations can have multiple solutions, Sage returns all solutions found as a list.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve( x^2 + x  == 6, x)
[x == -3, x == 2]
sage: solve(2*x^2 - x + 1 == 0, x)
[x == -1/4*I*sqrt(7) + 1/4, x == 1/4*I*sqrt(7) + 1/4]
sage: solve( exp(x) == -1, x)
[x == I*pi]
</pre></div>
</div>
<p>The solution set of certain inequalities consists of the union and intersection of open intervals.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve( x^2 - 6 &gt;= 3, x )
[[x &lt;= -3], [x &gt;= 3]]
sage: solve( x^2 - 6 &lt;= 3, x )
[[x &gt;= -3, x &lt;= 3]]
</pre></div>
</div>
<p>The <tt class="xref py py-func docutils literal"><span class="pre">solve()</span></tt> command will attempt to express the solution of an
equation without the use of floating point numbers. If this cannot be
done, it will return the solution in a symbolic form.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve( sin(x) == x, x)
[x == sin(x)]
sage: solve( exp(x) - x == 0 , x)
[x == e^x]
sage: solve( cos(x) - sin(x) == 0 , x)
[sin(x) == cos(x)]
sage: solve( cos(x) - exp(x) == 0 , x)
[cos(x) == e^x]
</pre></div>
</div>
<p id="index-29">To find a numeric approximation of the solution we can use the
<tt class="xref py py-func docutils literal"><span class="pre">find_root()</span></tt> command. Which requires both the expression and a closed
interval on which to search for a solution.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: find_root(sin(x) == x, -pi/2 , pi/2)
0.0
sage: find_root(sin(x) == cos(x), pi, 3*pi/2)
3.9269908169872414
</pre></div>
</div>
<p>This command will only return one solution on the specified interval, if one exists. It will not find the complete solution set over the entire real numbers.
To find a complete set of solutions, the reader must use <tt class="xref py py-func docutils literal"><span class="pre">find_root()</span></tt> repeatedly over cleverly selected intervals. Sadly, at this point, Sage cannot do all of the thinking for us. This feature is not planned until Sage 10.</p>
</div>
<div class="section" id="declaring-variables">
<span id="declare-variables"></span><span id="index-30"></span><h3>Declaring Variables<a class="headerlink" href="#declaring-variables" title="Permalink to this headline">¶</a></h3>
<p id="index-31">In the previous section we only solved equations in one variable, and we always used <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/>. When a session is started, Sage creates one symbolic variable, <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/>, and it can be used to solve equations.  If you want to use  an additional symbolic variable, you have to <em>declare it</em>  using the <tt class="xref py py-func docutils literal"><span class="pre">var()</span></tt> command. The name of a symbolic variable can be a letter, or a combination of letters and numbers:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: y,z,t = var(&quot;y z t&quot;)
sage: phi, theta, rho = var(&quot;phi theta rho&quot;)
sage: x1, x2 = var(&quot;x1 x2&quot;)
</pre></div>
</div>
<div class="admonition note">
<p class="first admonition-title">Note</p>
<p class="last">Variable names cannot contain spaces, for example &#8220;square root&#8221;
is not a valid variable name, whereas &#8220;square_root&#8221; is.</p>
</div>
<p>Attempting to use a symbolic variable before it has been declared will result in a <tt class="xref py py-exc docutils literal"><span class="pre">NameError</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: u
...
NameError: name &#39;u&#39; is not defined
sage: solve (u^2-1,u)
NameError                                 Traceback (most recent call last)
NameError: name &#39;u&#39; is not defined
</pre></div>
</div>
<p id="index-32">We can un-declare a symbolic variable, like the variable <tt class="docutils literal"><span class="pre">phi</span></tt> defined above,  by using the <tt class="xref py py-func docutils literal"><span class="pre">restore()</span></tt>
command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: restore(&#39;phi&#39;)
sage: phi
...
NameError: name &#39;phi&#39; is not defined
</pre></div>
</div>
</div>
<div class="section" id="solving-equations-with-several-variables">
<span id="solve-several-variables"></span><span id="index-33"></span><h3>Solving Equations with Several Variables<a class="headerlink" href="#solving-equations-with-several-variables" title="Permalink to this headline">¶</a></h3>
<p>Small systems of linear equations can be also solved using  <tt class="xref py py-func docutils literal"><span class="pre">solve()</span></tt>, provided that all the symbolic variables have been declared.
The equations must be input as a list, followed by the symbolic variables.  The result may be  either a unique solution, infinitely many solutions, or no solutions at all.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve( [3*x - y == 2, -2*x -y == 1 ], x,y)
[[x == (1/5), y == (-7/5)]]
sage: solve( [  2*x + y == -1 , -4*x - 2*y == 2],x,y)
[[x == -1/2*r1 - 1/2, y == r1]]
sage: solve( [  2*x - y == -1 , 2*x - y == 2],x,y)
[]
</pre></div>
</div>
<p>In the second equation above, <tt class="docutils literal"><span class="pre">r1</span></tt> signifies that there is a free
variable which parametrizes the solution set. When there is more than
one free variable, Sage enumerates them <tt class="docutils literal"><span class="pre">r1,r2,...,</span> <span class="pre">rk</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve([ 2*x + 3*y + 5*z == 1, 4*x + 6*y + 10*z == 2, 6*x + 9*y + 15*z == 3], x,y,z)
[[x == -5/2*r1 - 3/2*r2 + 1/2, y == r2, z == r1]]
</pre></div>
</div>
<p><tt class="xref py py-func docutils literal"><span class="pre">solve()</span></tt> can be very slow for large systems of equations. For these systems, it is best to use the linear algebra functions as they are quite efficient.</p>
<p>Solving inequalities in several variables can lead to complicated expressions, since the regions they define are complicated. In the example below, Sage&#8217;s solution is a list containing the point of interesection of the lines, then  two rays, then the region between the two rays.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve([ x-y &gt;=2, x+y &lt;=3], x,y)
[[x == (5/2), y == (1/2)], [x == -y + 3, y &lt; (1/2)], [x == y + 2, y &lt; (1/2)], [y + 2 &lt; x, x &lt; -y + 3, y &lt; (1/2)]]
sage: solve([ 2*x-y&lt; 4, x+y&gt;5, x-y&lt;6], x,y)
[[-y + 5 &lt; x, x &lt; 1/2*y + 2, 2 &lt; y]]
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Find all of the solutions to the equation <img class="math" src="_images/math/08d0505358e89b0ee6878768a65eb29e727da8d4.png" alt="x^3 - x = 7x^2 - 7"/>.</li>
<li>Find the complete solution set for the inequality <img class="math" src="_images/math/76c94c0bc91907c0f2e11cc4f340a9ba8efd6413.png" alt="\left\vert t - 7 \right\vert \geq 3"/>.</li>
<li>Find all <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/> and <img class="math" src="_images/math/b124ff74afb0914bb434e8fb849eb56d734412f8.png" alt="y"/> that satisfy both <img class="math" src="_images/math/b88a4b6ea40c50f80aacd2d21961234d34a4c331.png" alt="2x + y = 17"/> and <img class="math" src="_images/math/33e481fbb22fb663406dc071ab066bf252e0b2be.png" alt="x - 3y = -16"/>.</li>
<li>Use <tt class="xref py py-func docutils literal"><span class="pre">find_root()</span></tt> to find a solution of the equation <img class="math" src="_images/math/7816e2ac6d79eac79b3cf33d4ef5a7297a855083.png" alt="e^{x} = \cos(x)"/> on the interval <img class="math" src="_images/math/5ccd42d2959d7b66bb6386111d38a2b904e06e4d.png" alt="\left[-\pi/2, 0\right]"/>.</li>
<li>Change the command above so that <tt class="xref py py-func docutils literal"><span class="pre">find_root()</span></tt> finds the other solution in the same interval.</li>
</ol>
</div></blockquote>
</div>
</div>
<div class="section" id="calculus">
<span id="index-34"></span><span id="id4"></span><h2>Calculus<a class="headerlink" href="#calculus" title="Permalink to this headline">¶</a></h2>
<blockquote>
<div>You should be familiar with <a class="reference internal" href="#basic-arithmetic"><em>Basic Arithmetic</em></a>, <a class="reference internal" href="#basic-functions-and-constants"><em>Standard Functions and Constants</em></a>, and <a class="reference internal" href="#declare-variables"><em>Declaring Variables</em></a></div></blockquote>
<p id="index-35">Sage has many commands that are useful for the study of differential and integral calculus. We will begin our investigation of these command by defining a few functions that we will use throughout the chapter.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: f(x) = x*exp(x)
sage: f
x |--&gt; x*e^x
sage: g(x) = (x^2)*cos(2*x)
sage: g
x |--&gt; x^2*cos(2*x)
sage: h(x) = (x^2 + x - 2)/(x-4)
sage: h
x |--&gt; (x^2 + x - 2)/(x-4)
</pre></div>
</div>
<p>Sage uses <tt class="docutils literal"><span class="pre">x</span> <span class="pre">|--&gt;</span></tt> to tell you that the expression returned is actually a function and not just a number or string. This means that we can <em>evaluate</em> these expressions just like you would expect of any function.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: f(1)
e
sage: g(2*pi)
4*pi^2
sage: h(-1)
2/5
</pre></div>
</div>
<p>With these functions defined, we will look at how we can use Sage to compute the <em>limit</em> of these functions.</p>
<div class="section" id="limits">
<span id="index-36"></span><span id="id5"></span><h3>Limits<a class="headerlink" href="#limits" title="Permalink to this headline">¶</a></h3>
<p id="index-37">The limit of <img class="math" src="_images/math/ae05bf85f37f16cc1a762b493ffff70707cd5a45.png" alt="f(x) = xe^{x}"/> as <img class="math" src="_images/math/8527209c98facb06036dea7cbba05d278c5409d3.png" alt="x \rightarrow 1"/> is computed in Sage by entering the following command into Sage:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: limit(f, x=1)
e
</pre></div>
</div>
<p>We can do the same with <img class="math" src="_images/math/3af1f844d2ef477235eb582f56085d4b53bf7568.png" alt="g(x)"/>. To evaluate the limit of <img class="math" src="_images/math/335396129d639cbedb602f82dece26c3c233be12.png" alt="g(x) = x^{2} \cos(2x)"/> as <img class="math" src="_images/math/de26e0ff41c76f27bd512383027ee88dc44a2bfa.png" alt="x \rightarrow 2"/> we enter:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: limit(g, x=2)
4*cos(4)
</pre></div>
</div>
<p>The functions <img class="math" src="_images/math/14546c27a7b929642f7840acca5f851c503ea109.png" alt="f(x)"/> and <img class="math" src="_images/math/3af1f844d2ef477235eb582f56085d4b53bf7568.png" alt="g(x)"/> aren&#8217;t all that exciting as far as limits are concerned since they are both <em>continuous</em> for all real numbers. But <img class="math" src="_images/math/76ba6643845546f6fa099122e567295f76df75e9.png" alt="h(x)"/> has a discontinuity at <img class="math" src="_images/math/0a7f6b0197accaea94a009277c66957ce07e6175.png" alt="x=4"/>, so to investigate what is happening near this discontinuity we will look at the limit of <img class="math" src="_images/math/76ba6643845546f6fa099122e567295f76df75e9.png" alt="h(x)"/> as <img class="math" src="_images/math/2e4cd7d5e9652f7373ea0d68e788c44e4389ef08.png" alt="x \rightarrow 4"/>:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: limit(h, x = 4)
Infinity
</pre></div>
</div>
<p>Now this is an example of why we have to be a little careful when using computer algebra systems. The limit above is not exactly correct. See the graph of <img class="math" src="_images/math/76ba6643845546f6fa099122e567295f76df75e9.png" alt="h(x)"/> near this discontinuity below.</p>
<a class="reference internal image-reference" href="_images/asymptote.png"><img alt="&quot;Rational Function with vertical asymptote x=4&quot;" src="_images/asymptote.png" style="width: 400px; height: 300px;" /></a>
<p id="index-38">What we have when <img class="math" src="_images/math/0a7f6b0197accaea94a009277c66957ce07e6175.png" alt="x=4"/> is a <em>vertical asymptote</em> with the function tending toward <em>positive</em> infinity if <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/> is larger than <img class="math" src="_images/math/51a8d7e791ab9e463af82a4075edb04ef8028dcf.png" alt="4"/> and <em>negative</em> infinity from when <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/> less than <img class="math" src="_images/math/51a8d7e791ab9e463af82a4075edb04ef8028dcf.png" alt="4"/>. We can takes these <em>directional</em> limits using Sage to confirm this by supplying the extra <em>dir</em> argument.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: limit(h, x=4, dir=&quot;right&quot;)
+Infinity
sage: limit(h, x=4, dir=&quot;left&quot;)
-Infinity
</pre></div>
</div>
</div>
<div class="section" id="derivatives">
<span id="index-39"></span><span id="id6"></span><h3>Derivatives<a class="headerlink" href="#derivatives" title="Permalink to this headline">¶</a></h3>
<p id="index-40">The next thing we are going to do is use Sage to compute the <em>derivatives</em> of the functions that we defined earlier. For example, to compute <img class="math" src="_images/math/5bfb8bb45e68ad1a38367ce482d335beaffe9848.png" alt="f^{\prime}(x)"/>, <img class="math" src="_images/math/acf9916622b2b4d27e488db170cffd45b10c8b83.png" alt="g^{\prime}(x)"/>, and <img class="math" src="_images/math/2788ac6b6e04e06a9cde2cb155057efdfd8e3559.png" alt="h^{\prime}(x)"/> we will use the <tt class="xref py py-func docutils literal"><span class="pre">derivative()</span></tt> command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: fp  =  derivative(f,x)
sage: fp
x |--&gt; x*e^x + e^x
sage: gp =  derivative(g, x)
sage: gp
x |--&gt; -2*x^2*sin(2*x) + 2*x*cos(2*x)
sage: hp  = derivative(h,x)
sage: hp
x |--&gt; (2*x + 1)/(x - 4) - (x^2 + x - 2)/(x - 4)^2
</pre></div>
</div>
<p id="index-41">The first argument is the function which you would like to differentiate and the second argument is the variable with which you would like to differentiate with respect to. For example, if I were to supply a different variable, Sage will hold <img class="math" src="_images/math/188c175aac0a8a9c22499336711b5d7256407254.png" alt="x"/> constant and take the derivative with respect to that variable.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: y = var(&#39;y&#39;)
sage: derivative(f,y)
x |--&gt; 0
sage: derivative(g,y)
x |--&gt; 0
sage: derivative(h,y)
x |--&gt; 0
</pre></div>
</div>
<p>The <tt class="xref py py-func docutils literal"><span class="pre">derivative()</span></tt> command returns another function that can be evaluated like any other function.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: fp(10)
11*e^10
sage: gp(pi/2)
-pi
sage:
sage: hp(10)
1/2
</pre></div>
</div>
<p id="index-42">With the <em>derivative function</em> computed, we can then find the <em>critical points</em> using the <tt class="xref py py-func docutils literal"><span class="pre">solve()</span></tt> command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: solve( fp(x) == 0, x)
[x == -1, e^x == 0]
sage: solve( hp(x) == 0, x)
[x == -3*sqrt(2) + 4, x == 3*sqrt(2) + 4]
sage: solve( gp(x) == 0, x)
[x == 0, x == cos(2*x)/sin(2*x)]
</pre></div>
</div>
<p id="index-43">Constructing the line <em>tangent</em> to our functions at the point <img class="math" src="_images/math/9720777df6c2dd703d12038dcb62e4ac6934f7d0.png" alt="\left(x, f\left(x\right)\right)"/> is an important computation which is easily done in Sage. For example, the following command will compute the line tangent to <img class="math" src="_images/math/14546c27a7b929642f7840acca5f851c503ea109.png" alt="f(x)"/> at the point <img class="math" src="_images/math/22ad6fabd70d57cd212c3ce3f69ca588b526b6f0.png" alt="\left(0,f(0)\right)"/>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: T_f = fp(0)*( x - 0 ) + f(0)
sage: T_f
x
</pre></div>
</div>
<p>The same can be done for <img class="math" src="_images/math/3af1f844d2ef477235eb582f56085d4b53bf7568.png" alt="g(x)"/> and <img class="math" src="_images/math/76ba6643845546f6fa099122e567295f76df75e9.png" alt="h(x)"/>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: T_g = gp(0)*( x - 0 ) + g(0)
sage: T_g
0
sage: T_h = hp(0)*( x - 0 ) + h(0)
sage: T_h
-1/8*x + 1/2
</pre></div>
</div>
</div>
<div class="section" id="integrals">
<span id="index-44"></span><span id="id7"></span><h3>Integrals<a class="headerlink" href="#integrals" title="Permalink to this headline">¶</a></h3>
<p id="index-45">Sage has the facility to compute both <em>definite</em> and <em>indefinite</em> integral for many common functions. We will begin by computing the <em>indefinite</em> integral, otherwise known as the <em>anti-derivative</em>,  for each of the functions that we defined earlier. This will be done by using the <tt class="xref py py-func docutils literal"><span class="pre">integral()</span></tt> command which has arguments that are similar to <tt class="xref py py-func docutils literal"><span class="pre">derivative()</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: integral(f,x)
x |--&gt; (x - 1)*e^x
sage: integral(g, x)
x |--&gt; 1/4*(2*x^2 - 1)*sin(2*x) + 1/2*x*cos(2*x)
sage: integral(h, x)
x |--&gt; 1/2*x^2 + 5*x + 18*log(x - 4)
</pre></div>
</div>
<p>The function that is returned is only <em>one</em> of the many anti-derivatives that exist for each of these functions.
The others differ by a constant. We can verify that we have indeed computed the <em>anti-derivative</em> by taking the derivative of our indefinite integrals.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: derivative(integral(f,x), x )
x |--&gt; (x - 1)*e^x + e^x
sage: f
x |--&gt; x*e^x
sage: derivative(integral(g,x), x )
x |--&gt; 1/2*(2*x^2 - 1)*cos(2*x) + 1/2*cos(2*x)
sage: derivative(integral(h,x), x )
x |--&gt; x + 18/(x - 4) + 5
</pre></div>
</div>
<p>Wait, none of these look right. But a little algebra, and the use of a trig-identity or two in the case of <tt class="docutils literal"><span class="pre">1/2*(2*x^2</span> <span class="pre">-</span> <span class="pre">1)*cos(2*x)</span> <span class="pre">+</span> <span class="pre">1/2*cos(2*x)</span></tt>, you will see that they are indeed the same.</p>
<p>It should also be noted that there are some functions which are continuous and yet there doesn&#8217;t exist a <em>closed form</em> integral. A common example is <img class="math" src="_images/math/d95240b7768ce400e2942152b351884c1d7ee139.png" alt="e^{-x^2}"/> which forms the basis for the <em>normal distribution</em> which is ubiquitous throughout statistics.  The antiderivative for <img class="math" src="_images/math/90d8816a85fbfbfe45ee31ba1728c6e560ecfbe5.png" alt="er^{-x^2}"/> is commonly called  <img class="math" src="_images/math/f12f89c530a8d00837a6d2d3c62e063d3e447599.png" alt="\mathrm{erf}"/>, otherwise known as the <em>error function</em>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: y(x) = exp(-x^2)
sage: integral(y,x)
x |--&gt; 1/2*sqrt(pi)*erf(x)
</pre></div>
</div>
<p>We can also compute the <em>definite</em> integral for the functions that we defined earlier. This is done by specifying the <em>limits of integration</em> as addition arguments.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: integral(f, x,0,1)
x |--&gt; 1
sage: integral(g,x,0,1)
x |--&gt; 1/4*sin(2) + 1/2*cos(2)
sage: integral(h, x,0,1)
x |--&gt; 18*log(3) - 18*log(4) + 11/2
</pre></div>
</div>
<p>In each case above, Sage returns a <em>function</em> as its result. Each of these functions is a constant function, which is what we would expect. As it was pointed out earlier, Sage will return the expression that retains the most precision and will not use decimals unless told to. A quick way to tell Sage that an approximation is desired is wrap the <tt class="xref py py-func docutils literal"><span class="pre">integrate()</span></tt> command with <tt class="xref py py-func docutils literal"><span class="pre">n()</span></tt>, the numerical approximation command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: n(integral(f, x,0,1))
1.00000000000000
sage: n(integral(g, x,0,1))
0.0192509384328492
sage: n(integral(h, x,0,1))
0.321722695867944
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Use Sage to compute the following limits:<ol class="loweralpha">
<li><img class="math" src="_images/math/2e5c96df05483465f10f2355c83fe2c9b362f88c.png" alt="\lim_{x \rightarrow 2} \frac{x^{2} + 2 \, x - 8}{x-2}"/></li>
<li><img class="math" src="_images/math/94c72d8a1d36dcecfcf4856198553e1f4dc8b1e6.png" alt="\lim_{x \rightarrow (\pi/2)^{+}} \sec(x)"/></li>
<li><img class="math" src="_images/math/d8a7dcc2bde7044763f27ee7a82c1009851d3ec6.png" alt="\lim_{x \rightarrow (\pi/2)^{-}} \sec(x)"/></li>
</ol>
</li>
<li>Use Sage to compute the following <em>derivatives</em> with respect to the specified variables:<ol class="loweralpha">
<li><img class="math" src="_images/math/e203c23070c48bdd98b7734a8c00247428907d61.png" alt="\frac{d}{dx}\left[ x^{2}e^{3x}\cos(2x) \right]"/></li>
<li><img class="math" src="_images/math/455085d5fadf2b0e144ef65a8feaff1749bd3589.png" alt="\frac{d}{dt}\left[\frac{t^2 + 1}{t-2}\right]"/> <em>(remember to define ``t``)</em></li>
<li><img class="math" src="_images/math/4ef14ae3d98c17ed1326d40414d16cf2f5cabf54.png" alt="\frac{d}{dy}\left[ x\cos(x)\right]"/></li>
</ol>
</li>
<li>Use Sage to compute the following integrals:<ol class="loweralpha">
<li><img class="math" src="_images/math/688c063d62e8a7989261765a87074c7539aeda3b.png" alt="\int \frac{x+1}{x^2 + 2x + 1}dx"/></li>
<li><img class="math" src="_images/math/a45ef26d5633d9eaa0336efb0ea23b7fc5664978.png" alt="\int_{-\pi/4}^{\pi/4} \sec(x) dx"/></li>
<li><img class="math" src="_images/math/7931bdf43e25716ca553bae844bbc6b4646fb090.png" alt="\int x e^{-x^{2}} dx"/></li>
</ol>
</li>
</ol>
</div></blockquote>
</div>
</div>
<div class="section" id="statistics">
<span id="basic-stats"></span><span id="index-46"></span><h2>Statistics<a class="headerlink" href="#statistics" title="Permalink to this headline">¶</a></h2>
<p>You should be familiar with <a class="reference internal" href="#basic-arithmetic"><em>Basic Arithmetic</em></a></p>
<p>In this section we will discuss the use of some of the basic descriptive statistic functions availble for use in Sage.</p>
<p id="index-47">To demonstrate their usage we will first generate a pseudo-random list
of integers from 0 to 100 to describe. The <tt class="xref py py-func docutils literal"><span class="pre">random()</span></tt> function generates a random number from <img class="math" src="_images/math/68adca6871086a90d32b8c23c1c5c3aa5c19d282.png" alt="[0,1)"/>, so we will use a trick to generate integers in this specific range. Note, by the nature of random number generation your list of numbers will be different.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: data = [  int(random()*(100-0) + 0)  for i in [ 1 .. 20 ] ]
sage: data
[78, 43, 6, 50, 47, 94, 37, 70, 66, 32, 1, 34, 93,
30, 99, 82, 22, 74, 18, 40]
</pre></div>
</div>
<p id="index-48">We can compute the mean, median, mode, variance, and standard
deviation of this data.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: mean(data)
254/5
sage: median(data)
45
sage: mode(data)
[32, 1, 66, 99, 82, 37, 6, 40, 74, 43,
34, 78, 47, 50, 30, 22, 18, 70, 93, 94]
sage: variance(data)
83326/95
sage: std(data)
sqrt(83326/95)
</pre></div>
</div>
<p>Note that both the standard deviation and variance are computed in their unbiased forms. It we want to bias these measures then you can use the <tt class="docutils literal"><span class="pre">bias=True</span></tt> option.</p>
<p id="index-49">We can also compute a rolling, or moving, average of the data with the <tt class="xref py py-func docutils literal"><span class="pre">moving_average()</span></tt>.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: moving_average(data,4)
[177/4,73/2,197/4,57,62,267/4,205/4,169/4,
133/4,40,79/2,64,76,233/4,277/4,49,77/2]
sage: moving_average(data,10)
[523/10, 223/5,437/10,262/5,252/5, 278/5,
272/5,529/10,533/10,97/2,493/10]
sage: moving_average(data,20)
[254/5]
</pre></div>
</div>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Use Sage to generate a list of 20 random integers.</li>
<li>The heights of eight students, measured in inches, are <img class="math" src="_images/math/3c9d37807b4923652b3cb6ca692e984c7f04a5f1.png" alt="71,\ 73,\  59,\ 62,\ 65,\ 61,\ 73,\ 61"/>. Find the <em>average</em>, <em>median</em> and <em>mode</em> of the heights of these students.</li>
<li>Using the same data, compute the <em>standard deviation</em> and <em>variance</em> of the sampled heights.</li>
<li>Find the <em>range</em> of the heights. (<em>Hint: use the</em> <a class="reference external" href="http://docs.python.org/library/functions.html#max" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">max()</span></tt></a> <em>and</em> <a class="reference external" href="http://docs.python.org/library/functions.html#min" title="(in Python v2.7)"><tt class="xref py py-func docutils literal"><span class="pre">min()</span></tt></a> <em>commands</em>)</li>
</ol>
</div></blockquote>
</div>
<div class="section" id="plotting">
<span id="basic-plotting"></span><span id="index-50"></span><h2>Plotting<a class="headerlink" href="#plotting" title="Permalink to this headline">¶</a></h2>
<div class="section" id="d-graphics">
<span id="d-plotting-and-graphics"></span><h3>2D Graphics<a class="headerlink" href="#d-graphics" title="Permalink to this headline">¶</a></h3>
<blockquote>
<div>You should be familiar with <a class="reference internal" href="#basic-functions-and-constants"><em>Standard Functions and Constants</em></a> and <a class="reference internal" href="#solving-equations-inequalities"><em>Solving Equations and Inequalities</em></a></div></blockquote>
<p>Sage has many ways for us to visualize the mathematics with which we are working. In this section we will quickly you up to speed with some of the basic commands used when plotting functions and working with graphics.</p>
<p id="index-51">To produce a basic plot of <img class="math" src="_images/math/2090b37c0e560a57927ee95ca8466d041e89b2d5.png" alt="\sin(x)"/> from <img class="math" src="_images/math/2153fbec91bfdd24c31cfea02902ec1bfde339c5.png" alt="x=-\frac{\pi}{2}"/> to <img class="math" src="_images/math/17efb8f2711755d173cf23dd6fd16a03ece077a9.png" alt="x=\frac{\pi}{2}"/> we will use the <tt class="xref py py-func docutils literal"><span class="pre">plot()</span></tt> command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: f(x) = sin(x)
sage: p = plot(f(x), (x, -pi/2, pi/2))
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/sin_plot.png"><img alt="Plot of sin(x) from x = -pi/2 to pi/2" src="_images/sin_plot.png" style="width: 400px; height: 300px;" /></a>
<p id="index-52">By default, the plot created will be quite plain. To add axis labels
and make our plotted line purple, we can alter the plot attribute by
adding the <tt class="docutils literal"><span class="pre">axes_labels</span></tt> and <tt class="docutils literal"><span class="pre">color</span></tt> options.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: p = plot(f(x), (x,-pi/2, pi/2), axes_labels=[&#39;x&#39;,&#39;sin(x)&#39;], color=&#39;purple&#39;)
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/sin_plot_purple_labels.png"><img alt="Plot of sin with purple line and basic axis labels" src="_images/sin_plot_purple_labels.png" style="width: 400px; height: 300px;" /></a>
<p>The <tt class="docutils literal"><span class="pre">color</span></tt> option accepts string color designations ( &#8216;purple&#8217;, &#8216;green&#8217;, &#8216;red&#8217;, &#8216;black&#8217;, etc...), an RGB triple such as (.25,.10,1), or an HTML-style hex triple such as #ff00aa.</p>
<p id="index-53">We can change the style of line, whether it is solid, dashed, and it&#8217;s thickness by using the <tt class="docutils literal"><span class="pre">linestyle</span></tt> and the <tt class="docutils literal"><span class="pre">thickness</span></tt> options.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: p = plot(f(x), (x,-pi/2, pi/2), linestyle=&#39;--&#39;, thickness=3)
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/sin_plot_dashed_thick.png"><img alt="Plot of sin(x) using a thick dashed blue line" src="_images/sin_plot_dashed_thick.png" style="width: 400px; height: 300px;" /></a>
<p id="index-54">We can display the graphs of two functions on the same axes by adding the plots together.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: f(x) = sin(x)
sage: g(x) = cos(x)
sage: p = plot(f(x),(x,-pi/2,pi/2), color=&#39;black&#39;)
sage: q = plot(g(x), (x,-pi/2, pi/2), color=&#39;red&#39;)
sage: r = p + q
sage: r.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/sin_cos_plot.png"><img alt="Plot of sin(x) and cos(x) on the same axes" src="_images/sin_cos_plot.png" style="width: 400px; height: 300px;" /></a>
<p>To tie together our plotting commands with some material we have
learned earlier, let&#8217;s use the <tt class="xref py py-func docutils literal"><span class="pre">find_root()</span></tt> command to find the
point where <img class="math" src="_images/math/2090b37c0e560a57927ee95ca8466d041e89b2d5.png" alt="\sin(x)"/> and <img class="math" src="_images/math/c17067ad98227b7cae5ec9ff03de21dfad599e22.png" alt="\cos(x)"/> intersect. We will then add this point to the graph and label it.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: find_root( sin(x) == cos(x),-pi/2, pi/2 )
0.78539816339744839
sage: P = point( [(0.78539816339744839, sin(0.78539816339744839))] )
sage: T = text(&quot;(0.79,0.71)&quot;, (0.78539816339744839, sin(0.78539816339744839) + .10))
sage: s = P + r + T
sage: s.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/sin_cos_point_plot.png"><img alt="sin(x) and cos(x) on same axes with point of intersection labeled" src="_images/sin_cos_point_plot.png" style="width: 400px; height: 300px;" /></a>
<p>Sage handles many of the details of producing &#8220;nice&#8221; looking plots in
a way that is transparent to the user. However there are times in
which Sage will produce a plot which isn&#8217;t quite what we were
expecting.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: f(x) = (x^3 + x^2 + x)/(x^2 - x -2 )
sage: p = plot(f(x), (x, -5,5))
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/rat_func_with_asymptotes.png"><img alt="Plot of rational function with asymptotes" src="_images/rat_func_with_asymptotes.png" style="width: 400px; height: 300px;" /></a>
<p>The vertical asymptotes of this rational function cause Sage to adjust the aspect ratio of the plot to display the rather large <img class="math" src="_images/math/b124ff74afb0914bb434e8fb849eb56d734412f8.png" alt="y"/> values near <img class="math" src="_images/math/5e2bbf8db6a6ffda9f8d85b53d97cf0dd02790d6.png" alt="x=-1"/> and <img class="math" src="_images/math/744b37ad640210b6603308ec85a1ecbb8ba17a81.png" alt="x=2"/>. This obfuscates most of the features of this function in a way that we may have not intended. To remedy this we can explicitly adjust the vertical and horizontal limits of our plot</p>
<div class="highlight-python"><div class="highlight"><pre>sage: p.show(xmin=-2, xmax=4, ymin=-20, ymax=20)
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/rat_func_with_asymptotes_adj.png"><img alt="Plot of rational function with asymptote with vertical limits adjusted" src="_images/rat_func_with_asymptotes_adj.png" style="width: 400px; height: 300px;" /></a>
<p>This, in the author&#8217;s opinion, displays the features of this particular function in a much more pleasing fashion.</p>
<p id="index-55">Sage can handle parametric plots with the <tt class="xref py py-func docutils literal"><span class="pre">parametric_plot()</span></tt> command. The following is a simple circle of radius 3.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: t = var(&#39;t&#39;)
sage: p = parametric_plot( [3*cos(t), 3*sin(t)], (t, 0, 2*pi) )
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/parametric_circle.png"><img alt="Circle of radius 3 centered at the origin" src="_images/parametric_circle.png" style="width: 400px; height: 300px;" /></a>
<p id="index-56">The default choice of aspect ratio makes the plot above decidedly
&#8220;un-circle like&#8221;. We can adjust this by using the <tt class="docutils literal"><span class="pre">aspect_ratio</span></tt>
option.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: p.show(aspect_ratio=1)
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/parametric_circle_fixed.png"><img alt="Circle of radius 3 with 1/1 aspect ratio" src="_images/parametric_circle_fixed.png" style="width: 400px; height: 300px;" /></a>
<p>The different plotting commands accept many of the same options as
plot. The following generates the Lissajous Curve <img class="math" src="_images/math/b30241b762d4d85984c5dc348a1aa87fa2643d9a.png" alt="L(3,2)"/> with
a thick red dashed line.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: p = parametric_plot( [sin(3*t), sin(2*t)], (t, 0, 3*pi), thickness=2, color=&#39;red&#39;, linestyle=&quot;--&quot;)
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/L3,2-red.png"><img alt="Lissajous Curve L(3,2)" src="_images/L3,2-red.png" style="width: 400px; height: 300px;" /></a>
<p id="index-57">Polar plots can be done using the <tt class="xref py py-func docutils literal"><span class="pre">polar_plot()</span></tt> command.</p>
<div class="highlight-python"><div class="highlight"><pre>sage: theta = var(&quot;theta&quot;)
sage: r(theta) = sin(4*theta)
sage: p = polar_plot((r(theta)), (theta, 0, 2*pi) )
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/8petal-polar.png"><img alt="Eight Petal 'folium' curve" src="_images/8petal-polar.png" style="width: 400px; height: 300px;" /></a>
<p>And finally, Sage can do the plots for functions that are implicitly defined. For example, to display all points <img class="math" src="_images/math/5f81ea407dc24031569231ab2cd28222176f38ca.png" alt="(x,y)"/> that satisfy the equation <img class="math" src="_images/math/a91e665d10385c213ffadf5e147e7a810f073dfd.png" alt="4x^2y - 3y = x^3 -1"/>, we enter the following:</p>
<div class="highlight-python"><div class="highlight"><pre>sage: implicit_plot(4*x^2*y - 3*y == x^3 - 1, (x,-10,10),(y,-10,10))
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/implicit_plot1.png"><img alt="Example of plotting a curve defined implicitly" src="_images/implicit_plot1.png" style="width: 400px; height: 300px;" /></a>
<p><strong>Exercises:</strong></p>
<blockquote>
<div><ol class="arabic simple">
<li>Plot the graph of <img class="math" src="_images/math/f60111893f87caed37f17016d46869981c35ca44.png" alt="y = \sin\left(\pi x - \pi  \right)"/> for <img class="math" src="_images/math/5e4f9d041b7fdfff218543cbf404c56ddc329f22.png" alt="-1 \leq x \leq 1"/> using a thick red line.</li>
<li>Plot the graph of <img class="math" src="_images/math/93a90c2ce6c81acf7bcaa83c66d7379e74cfd0e1.png" alt="\cos\left(\pi x - \pi \right)"/> on the same interval using a thick blue line.</li>
<li>Plot the two graphs above on the same set of axes.</li>
<li>Plot the graph of <img class="math" src="_images/math/3d65372c78460d443492c41a00094f27cc01d630.png" alt="y = 1/x"/> for <img class="math" src="_images/math/5e4f9d041b7fdfff218543cbf404c56ddc329f22.png" alt="-1 \leq x \leq 1"/> adjusting the range so that only <img class="math" src="_images/math/94275294f6d84b9eabb7523b8f2f315b1e16c8a3.png" alt="-10 \leq y \leq 10"/>.</li>
<li>Use the commands in this section to produce the following image:</li>
</ol>
<a class="reference internal image-reference" href="_images/circles.png"><img alt="Two circles of radius 3." src="_images/circles.png" style="width: 400px; height: 300px;" /></a>
</div></blockquote>
</div>
<div class="section" id="id8">
<span id="id9"></span><h3>3D Graphics<a class="headerlink" href="#id8" title="Permalink to this headline">¶</a></h3>
<p id="index-58">Producing 3D plots can be done using the <tt class="xref py py-func docutils literal"><span class="pre">plot3d()</span></tt> command</p>
<div class="highlight-python"><div class="highlight"><pre>sage: x,y = var(&quot;x y&quot;)
sage: f(x,y) = x^2 - y^2
sage: p = plot3d(f(x,y), (x,-10,10), (y,-10,10))
sage: p.show()
</pre></div>
</div>
<a class="reference internal image-reference" href="_images/3d-plot-1.png"><img alt="Snapshot of 3D plot" src="_images/3d-plot-1.png" style="width: 500px; height: 500px;" /></a>
<p>Sage handles 3d plotting a bit differently than what we have seen thus far. It uses a program named jmol to generate interactive plots. So instead of just a static picture we will see either a window like pictured above or, if you are using Sage&#8217;s notebook interface, a java applet in your browser&#8217;s window.</p>
<p>One nice thing about the way that Sage does this is that you can rotate your plot by just clicking on the surface and dragging it in the direction in which you would like for it to rotate. Zooming in/out can also be done by using your mouse&#8217;s wheel button (or two-finger vertical swipe on a mac). Once you have rotated and zoomed the plot to your liking, you can save the plot as a file. Do this by right-clicking anywhere in the window/applet and selecting save, then png-image as pictured below</p>
<a class="reference internal image-reference" href="_images/3d-plot-2.png"><img alt="Saving a 3d plot to a file in Jmol" src="_images/3d-plot-2.png" style="width: 500px; height: 500px;" /></a>
<div class="admonition note">
<p class="first admonition-title">Note</p>
<p class="last">If you are running Sage on windows or on sagenb.org that your file will be saved either in your VMware virtual machine or on sagenb.org.</p>
</div>
</div>
</div>
</div>


          </div>
        </div>
      </div>
    <div class="sphinxsidebar">
        <div class="sphinxsidebarwrapper">

	  <h3><a href="index.html">Topics</a></h3>
	  <ul class="current">
<li class="toctree-l1"><a class="reference internal" href="about.html">About this tutorial</a></li>
<li class="toctree-l1 current"><a class="current reference internal" href="">Sage as a Calculator</a><ul>
<li class="toctree-l2"><a class="reference internal" href="#arithmetic-and-functions">Arithmetic and Functions</a><ul>
<li class="toctree-l3"><a class="reference internal" href="#basic-arithmetic">Basic Arithmetic</a></li>
<li class="toctree-l3"><a class="reference internal" href="#integer-division-and-factoring">Integer Division and Factoring</a></li>
<li class="toctree-l3"><a class="reference internal" href="#standard-functions-and-constants">Standard Functions and Constants</a></li>
</ul>
</li>
<li class="toctree-l2"><a class="reference internal" href="#solving-equations-and-inequalities">Solving Equations and Inequalities</a><ul>
<li class="toctree-l3"><a class="reference internal" href="#solving-for-x">Solving for x</a></li>
<li class="toctree-l3"><a class="reference internal" href="#declaring-variables">Declaring Variables</a></li>
<li class="toctree-l3"><a class="reference internal" href="#solving-equations-with-several-variables">Solving Equations with Several Variables</a></li>
</ul>
</li>
<li class="toctree-l2"><a class="reference internal" href="#calculus">Calculus</a><ul>
<li class="toctree-l3"><a class="reference internal" href="#limits">Limits</a></li>
<li class="toctree-l3"><a class="reference internal" href="#derivatives">Derivatives</a></li>
<li class="toctree-l3"><a class="reference internal" href="#integrals">Integrals</a></li>
</ul>
</li>
<li class="toctree-l2"><a class="reference internal" href="#statistics">Statistics</a></li>
<li class="toctree-l2"><a class="reference internal" href="#plotting">Plotting</a><ul>
<li class="toctree-l3"><a class="reference internal" href="#d-graphics">2D Graphics</a></li>
<li class="toctree-l3"><a class="reference internal" href="#id8">3D Graphics</a></li>
</ul>
</li>
</ul>
</li>
<li class="toctree-l1"><a class="reference internal" href="sageprog.html">Programming in Sage</a></li>
<li class="toctree-l1"><a class="reference internal" href="mathstruct.html">Mathematical Structures</a></li>
</ul>

	  <h3>This Page</h3>
	  <ul class="this-page-menu">
	    <li><a href="_sources/sagecalc.txt"
	    rel="nofollow">Show Source</a></li>
	  </ul>
	<div id="searchbox" style="display: none">
	  <h3>Quick search</h3>
	  <form class="search" action="search.html" method="get">
	  <input type="text" name="q" size="18" />
	  <input type="submit" value="Go" />
	  <input type="hidden" name="check_keywords" value="yes" />
	  <input type="hidden" name="area" value="default" />
	  </form>
	</div>
	<script type="text/javascript">$('#searchbox').show(0);</script>
       </div>
    </div>

      <div class="clearer"></div>
    </div> 
<div class="related"> &nbsp; </div>

    <div class="footer">
        &copy; Copyright 2011, Michael O&#39;Sullivan,  David Monarres.
      Created using <a href="http://sphinx-doc.org/">Sphinx</a> 1.2.2.
    </div>
  </body>
</html>